<template>
    <div class="content">
        <div>
            <h1 class="title">Время обновления изображения</h1>
            <div class="banner-or-video">
                <img src="@/assets/img/news/fps/refresh-times.png" alt="fps">
            </div>
            <p class="text">На рисунке выше показано, почему мониторы с более высокой частотой обновления стали стандартом в
                соревновательной игровой среде. Обычный дисплей с частотой обновления 60 Гц (которая на данный момент
                является самой распространенной частотой обновления) может обновлять изображение не более 60 раз в секунду,
                поэтому даже если ваш GPU способен отрисовывать гораздо больше кадров в секунду, вы все равно увидите только
                60 изображений в секунду. Монитор с частотой обновления 144 Гц более чем вдвое увеличит количество
                отображаемых изображений в секунду (при условии, что ваше оборудование способно генерировать достаточное
                количество кадров, и наличие подходящего оборудования является важным фактором при покупке монитора с
                высокой частотой обновления), что приведет к более четкому и плавному изображению.
                <br><br>
                Иллюстрация ниже наглядно демонстрирует это: при 60 Гц движущийся объект в игровом мире может казаться
                рваным, почти так, словно он "телепортируется" с одной позиции на другую. Это может значительно снизить вашу
                способность отслеживать быстро движущихся игроков или объекты в игре. При более высоких частотах кадров эти
                быстро движущиеся игровые объекты отображаются гораздо более плавно благодаря более частому обновлению их
                позиции на экране.
            </p>
        </div>

        <div>
            <h1 class="title">Частота обновления изображения</h1>
            <div class="banner-or-video">
                <img src="@/assets/img/news/fps/refresh-rate.png" alt="fps">
            </div>
            <p class="text">Современные игровые мониторы имеют частоту обновления до 360 Гц, обеспечивая исключительную
                четкость и плавность. Некоторые люди утверждают (в большинстве случаев, шутя), что человеческий глаз не
                может видеть более 30 кадров в секунду, но эти утверждения ложны и происходят из интернет-мема. Игра на
                мониторе с более высокой частотой обновления не обязательно сделает вас лучшим игроком, но эффект мгновенно
                заметен, хотя с убывающей отдачей. Переход с 60 FPS на 144 FPS будет существенным изменением и может даже
                вызвать дискомфорт при игре в быстротемповую игру на обычном мониторе с частотой обновления 60 Гц, в то
                время как переход с 144 Гц на 240 Гц будет менее впечатляющим (хотя разница все же заметна для большинства
                людей).
            </p>
        </div>
    </div>
</template>
<script></script>
<style scoped>
.content {
    background: rgba(0, 0, 0, 0.57);
    border-radius: 0px 0px 10px 10px;
    padding: 0 20px;
    margin-bottom: 30px;
}

.title {
    text-align: start;
    padding: 15px 0 20px 0;
}

.banner-or-video {
    display: flex;
    justify-content: center;
    align-items: center;
}

.banner-or-video img {
    width: 970px;
    height: 545px;
}

.text {
    max-width: 1000px;
    padding: 30px 15px 30px 15px;
    line-height: 20px;
}</style>