<template>
    <div class="content">
        <div>
            <h1 class="title">Вступление</h1>
            <p class="text">Обычные мониторы (не совместимые с G-Sync) обновляют изображение на экране с фиксированной
                частотой
                (так называемой "частотой обновления"). Если у вас есть монитор с частотой обновления 100 Гц, он будет
                обновлять
                экран 100 раз в секунду. Однако скорость кадров, генерируемых вашим графическим процессором (GPU), может
                варьироваться в зависимости от многих факторов (например, от количества действия на экране, мощности
                графической
                карты и т. д.), и это не идеально для достижения плавного вида игры.
                <br><br>
                Если ваш компьютер (а следовательно, что более важно - ваш GPU) недостаточно мощный для визуализации
                достаточного количества кадров, соответствующего частоте обновления вашего монитора, это вызовет заикание
                изображения на экране. Это само по себе не является серьезной проблемой, но это не самый приятный вид и
                может
                снизить производительность, например, в многопользовательских играх. Если ваша система генерирует больше
                кадров,
                чем может отобразить ваш монитор, это может вызвать разрыв изображения на экране (см. изображение выше).
                Опять
                же, это само по себе не является серьезной проблемой (некоторые люди не обращают на это особого внимания,
                если
                заикание или разрыв не являются слишком заметными), но это неудобно смотреть и может вызывать проблемы с
                производительностью в игре.
            </p>
        </div>

        <div>
            <h1 class="title">Как работает G-Sync</h1>
            <p class="text">G-Sync, при правильном использовании, устраняет разрывы и заикание изображения на экране,
                изменяя
                частоту обновления монитора (поэтому вам нужен совместимый с G-Sync монитор, а не просто любой монитор),
                чтобы
                она всегда соответствовала количеству кадров, генерируемых GPU. Это гарантирует, что GPU никогда не
                генерирует
                меньше кадров, чем отображается на экране, и не генерирует больше кадров, чем способен отобразить монитор.
                Обратите внимание, что G-Sync перестанет работать должным образом, если скорость кадров упадет ниже 30
                кадров в
                секунду.
                <br><br>
                G-Sync отлично выполняет то, что обещает, однако это собственная технология, что означает, что вам придется
                вложиться в монитор с модулем G-Sync (что будет стоить дополнительно), а также вам понадобится графическая
                карта
                Nvidia. Возможно использование мониторов с G-Sync с видеокартами AMD, но частота кадров не будет
                синхронизироваться, таким образом утрачивая одно из основных преимуществ совместимого с G-Sync монитора.
                <br><br>
                Если вы готовы вложиться в монитор с G-Sync и хотите играть в игры без проблем с разрывами или заиканием
                изображения, то G-Sync может быть ответом на ваши проблемы, при условии, что вы готовы заплатить немного
                больше.
            </p>
        </div>
    </div>
</template>
<script></script>
<style scoped>
.content {
    background: rgba(0, 0, 0, 0.57);
    border-radius: 0px 0px 10px 10px;
    padding: 0 20px;
    margin-bottom: 30px;
}
.title {
    text-align: start;
    padding: 15px 0 20px 0;
}

.banner-or-video {
    display: flex;
    justify-content: center;
    align-items: center;
}

.text {
    max-width: 1000px;
    padding: 30px 15px 30px 15px;
    line-height: 20px;
}</style>